tap "tofuutils/tap"
tap "cargo-lambda/cargo-lambda"

brew "gh"
brew "awscli@2"
brew "aws-vault"
brew "tofuenv"
brew "terragrunt"
brew "tflint"
brew "trivy"
brew "bashunit"
brew "shellcheck"
brew "markdownlint-cli"
brew "jq"
brew "yq"
brew "openssl"
brew "rustup"
brew "libpq"
brew "postgresql@18"
brew "pgvector"
brew "prek"
brew "cargo-audit"
brew "rust-analyzer"
brew "cargo-lambda/cargo-lambda/cargo-lambda"
brew "act"

cask "orbstack"
cask "rustrover"
cask "datagrip"
cask "bruno"
cask "session-manager-plugin"
cask "claude-code@latest"
